marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_PLLDIG.h
    #define PLLDIG_PLL0DV_RFDPHI1_MASK32            ((uint32)0x78000000U)
    #define PLLDIG_PLL0DV_RFDPHI1_SHIFT32           ((uint32)27U)

    #define PLLDIG_PLL0DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
    #define PLLDIG_PLL0DV_RFDPHI_SHIFT32            ((uint32)16U)

    #define PLLDIG_PLL0DV_PREDIV_MASK32             ((uint32)0x00007000U)
    #define PLLDIG_PLL0DV_PREDIV_SHIFT32            ((uint32)12U)

    #define PLLDIG_PLL0DV_MFD_MASK32                ((uint32)0x0000007FU)

#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29))
    #define PLLDIG_PLL0DV_RWBITS_MASK32             ((uint32)0x7E3F70FFU)
    #define PLLDIG_PLL0DV_RESBITS_MASK32            ((uint32)0x00000000U)

    #define PLLDIG_PLL0DV_RFDPHI1_MASK32            ((uint32)0x7E000000U)
    #define PLLDIG_PLL0DV_RFDPHI1_SHIFT32           ((uint32)25U)

    #define PLLDIG_PLL0DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
    #define PLLDIG_PLL0DV_RFDPHI_SHIFT32            ((uint32)16U)

    #define PLLDIG_PLL0DV_PREDIV_MASK32             ((uint32)0x00007000U)
    #define PLLDIG_PLL0DV_PREDIV_SHIFT32            ((uint32)12U)

    #define PLLDIG_PLL0DV_MFD_MASK32                ((uint32)0x000000FFU)

#endif

/**************************************************************/
/*                 PLLDIG_PLL0FM                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL0FM_RWBITS_MASK32             ((uint32)0x43FF07FFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL0FM_RWBITS_MASK32             ((uint32)0x63FF07FFU)
#else
    #define PLLDIG_PLL0FM_RWBITS_MASK32             ((uint32)0x7FFF07FFU)
#endif /* (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) */

#define PLLDIG_PLL0FM_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL0FM_SSCGBYP_MASK32            ((uint32)0x40000000U)

#define PLLDIG_PLL0FM_MODSEL_MASK32             ((uint32)0x20000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29))
    #define PLLDIG_PLL0FM_MODPRD_MASK32             ((uint32)0x03FF0000U)
    #define PLLDIG_PLL0FM_STEPSIZE_MASK32           (PLLDIG_PLL0FM_MODPRD_MASK32)
#else
    #define PLLDIG_PLL0FM_MODPRD_MASK32             ((uint32)0x1FFF0000U)
#endif /* (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) */

#define PLLDIG_PLL0FM_MODPRD_SHIFT32            ((uint32)16U)
#define PLLDIG_PLL0FM_STEPSIZE_SHIFT32          (PLLDIG_PLL0FM_MODPRD_SHIFT32)

#define PLLDIG_PLL0FM_INCSTP_MASK32             ((uint32)0x000007FFU)
#define PLLDIG_PLL0FM_STEPNO_MASK32             (PLLDIG_PLL0FM_INCSTP_MASK32)

#define PLLDIG_PLL0FM_INCSTP_SHIFT32            ((uint32)0U)
#define PLLDIG_PLL0FM_STEPNO_SHIFT32            (PLLDIG_PLL0FM_INCSTP_SHIFT32)


/**************************************************************/
/*                 PLLDIG_PLL0FD                              */
/**************************************************************/

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL0FD_RWBITS_MASK32             ((uint32)0x703F7FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL0FD_RWBITS_MASK32             ((uint32)0x40007FFFU)
#else
    #define PLLDIG_PLL0FD_RWBITS_MASK32             ((uint32)0x70037FFFU)
#endif

#define PLLDIG_PLL0FD_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL0FD_SMDEN_MASK32              ((uint32)0x40000000U)
#define PLLDIG_PLL0FD_SDM2_MASK32               ((uint32)0x20000000U)
#define PLLDIG_PLL0FD_SDM3_MASK32               ((uint32)0x10000000U)

#define PLLDIG_PLL0FD_DTHDIS_MASK32             ((uint32)0x00030000U)
#define PLLDIG_PLL0FD_DTHDIS_SHIFT32            ((uint32)16U)

#define PLLDIG_PLL0FD_MFN_MASK32                ((uint32)0x00007FFFU)
#define PLLDIG_PLL0FD_MFN_SHIFT32               ((uint32)0U)

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL0FD_DTHRCTL_MASK32                ((uint32)0x003C0000U)
    #define PLLDIG_PLL0FD_DTHRCTL_SHIFT32               ((uint32)18U)
#endif

/**************************************************************/
/*                 PLLDIG_PLL0CAL1                            */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL0CAL1_BYPCAL_MASK32             ((uint32)0x80000000U)
#endif

/**************************************************************/
/*                 PLLDIG_PLL1CAL3                            */
/**************************************************************/
#define PLLDIG_PLL1CAL3_RWBITS_MASK32           ((uint32)0x3FFFC000U)
#define PLLDIG_PLL1CAL3_RESBITS_MASK32          ((uint32)0x00000000U)

#define PLLDIG_PLL1CAL3_MDFEN_MASK32            ((uint32)0x3FFFC000U)
#define PLLDIG_PLL1CAL3_MDFEN_SHIFT32           ((uint32)14U)

/**************************************************************/
/*                 PLLDIG_PLL1CR                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_00)
    #define PLLDIG_PLL1CR_RWBITS_MASK32         ((uint32)0x0000000AU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01)
    #define PLLDIG_PLL1CR_RWBITS_MASK32         ((uint32)0x00000008U)
#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13))
    #define PLLDIG_PLL1CR_RWBITS_MASK32         ((uint32)0x0000008CU)
#elif (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00)
    #define PLLDIG_PLL1CR_RWBITS_MASK32         ((uint32)0x00000308U)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL1CR_RWBITS_MASK32         ((uint32)0x00000008U)
#endif

#define PLLDIG_PLL1CR_RESBITS_MASK32            ((uint32)0x00000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) \
    )
    #define PLLDIG_PLL1CR_EXPDIE_MASK32         ((uint32)0x00000080U)
#endif

#define PLLDIG_PLL1CR_LOLIE_MASK32              ((uint32)0x00000008U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13))
    #define PLLDIG_PLL1CR_LOLRE_MASK32          ((uint32)0x00000004U)
#endif

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_00)
    #define PLLDIG_PLL1CR_LOCIE_MASK32          ((uint32)0x00000002U)
#endif


