marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_PLLDIG.h
/* Clock Configuration status */
#define PLLDIG_PLL1CR_CLKCFG_MASK32             (PLLDIG_PLLxCR_CLKCFG_MASK32)
/* PLL off */
#define PLLDIG_PLL1CR_CLKCFG_BO_U32             ((uint32)0x00000000U)
/* Normal mode with PLL running */
#define PLLDIG_PLL1CR_CLKCFG_NR_U32             (PLLDIG_PLL1CR_CLKCFG_MASK32)

/**************************************************************/
/*                 PLLDIG_PLL1SR                              */
/**************************************************************/
#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) || \
     (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29) \
    )
    #define PLLDIG_PLL1SR_RWBITS_MASK32         ((uint32)0x00000008U)
#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) \
      )
    #define PLLDIG_PLL1SR_RWBITS_MASK32         ((uint32)0x00000088U)
#endif

#define PLLDIG_PLL1SR_RESBITS_MASK32            ((uint32)0x00000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) \
    )
    #define PLLDIG_PLL1SR_EXTPDF_MASK32         ((uint32)0x00000080U)
#endif

#define PLLDIG_PLL1SR_LOLF_MASK32               ((uint32)0x00000008U)
#define PLLDIG_PLL1SR_LOCK_MASK32               ((uint32)0x00000004U)

/**************************************************************/
/*                 PLLDIG_PLL1DV                              */
/**************************************************************/
#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )

    #define PLLDIG_PLL1DV_RWBITS_MASK32             ((uint32)0x003F007FU)
    #define PLLDIG_PLL1DV_RESBITS_MASK32            ((uint32)0x00000000U)

    #define PLLDIG_PLL1DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
    #define PLLDIG_PLL1DV_RFDPHI_SHIFT32            ((uint32)16U)

    #define PLLDIG_PLL1DV_MFD_MASK32                ((uint32)0x0000007FU)

#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29))
    #define PLLDIG_PLL1DV_RWBITS_MASK32             ((uint32)0x7E3F70FFU)
    #define PLLDIG_PLL1DV_RESBITS_MASK32            ((uint32)0x00000000U)

    #define PLLDIG_PLL1DV_RFDPHI1_MASK32            ((uint32)0x7E000000U)
    #define PLLDIG_PLL1DV_RFDPHI1_SHIFT32           ((uint32)25U)

    #define PLLDIG_PLL1DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
    #define PLLDIG_PLL1DV_RFDPHI_SHIFT32            ((uint32)16U)

    #define PLLDIG_PLL1DV_PREDIV_MASK32             ((uint32)0x00007000U)
    #define PLLDIG_PLL1DV_PREDIV_SHIFT32            ((uint32)12U)

    #define PLLDIG_PLL1DV_MFD_MASK32                ((uint32)0x000000FFU)

#endif

/**************************************************************/
/*                 PLLDIG_PLL1FM                              */
/**************************************************************/
#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    #define PLLDIG_PLL1FM_RWBITS_MASK32             ((uint32)0x7FFF7FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL1FM_RWBITS_MASK32             ((uint32)0x00000000U)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FM_RWBITS_MASK32             ((uint32)0x43FF07FFU)
#endif

#define PLLDIG_PLL1FM_RESBITS_MASK32                ((uint32)0x00000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    #define PLLDIG_PLL1FM_MODEN_MASK32              ((uint32)0x40000000U)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FM_SSCGBYP_MASK32            ((uint32)0x40000000U)
#endif

#define PLLDIG_PLL1FM_MODSEL_MASK32                 ((uint32)0x20000000U)

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FM_MODPRD_MASK32                 ((uint32)0x03FF0000U)
    #define PLLDIG_PLL1FM_STEPSIZE_MASK32               (PLLDIG_PLL1FM_MODPRD_MASK32)
#else
    #define PLLDIG_PLL1FM_MODPRD_MASK32                 ((uint32)0x1FFF0000U)
#endif

#define PLLDIG_PLL1FM_MODPRD_SHIFT32                ((uint32)16U)
#define PLLDIG_PLL1FM_STEPSIZE_SHIFT32              (PLLDIG_PLL1FM_MODPRD_SHIFT32)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    #define PLLDIG_PLL1FM_INCSTP_MASK32                 ((uint32)0x00007FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FM_INCSTP_MASK32                 ((uint32)0x000007FFU)
    #define PLLDIG_PLL1FM_STEPNO_MASK32                 (PLLDIG_PLL1FM_INCSTP_MASK32)
#endif

#define PLLDIG_PLL1FM_INCSTP_SHIFT32                ((uint32)0U)
#define PLLDIG_PLL1FM_STEPNO_SHIFT32                (PLLDIG_PLL1FM_INCSTP_SHIFT32)

/**************************************************************/
/*                 PLLDIG_PLL1FD                              */
/**************************************************************/
#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    #define PLLDIG_PLL1FD_RWBITS_MASK32             ((uint32)0x40030FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL1FD_RWBITS_MASK32             ((uint32)0x40007FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FD_RWBITS_MASK32             ((uint32)0x703F7FFFU)
#endif

#define PLLDIG_PLL1FD_RESBITS_MASK32                ((uint32)0x00000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    #define PLLDIG_PLL1FD_FDEN_MASK32               ((uint32)0x40000000U)
#endif

