marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_PLLDIG.h
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL3FD_DTHRCTL_MASK32                ((uint32)0x003C0000U)
    #define PLLDIG_PLL3FD_DTHRCTL_SHIFT32               ((uint32)18U)
#endif

/**************************************************************/
/*                 PLLDIG_PLL4CR                              */
/**************************************************************/
#define PLLDIG_PLL4CR_RWBITS_MASK32             ((uint32)0x00000008U)
#define PLLDIG_PLL4CR_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL4CR_LOLIE_MASK32              ((uint32)0x00000008U)

#define PLLDIG_PLL4CR_CLKCFG_MASK32             (PLLDIG_PLLxCR_CLKCFG_MASK32)

/* Clock Configuration status */
/* PLL off */
#define PLLDIG_PLL4CR_CLKCFG_BO_U32             ((uint32)0x00000000U)
/* Normal mode with PLL running */
#define PLLDIG_PLL4CR_CLKCFG_NR_U32             (PLLDIG_PLL4CR_CLKCFG_MASK32)

/**************************************************************/
/*                 PLLDIG_PLL4SR                              */
/**************************************************************/
#define PLLDIG_PLL4SR_RWBITS_MASK32             ((uint32)0x00000008U)
#define PLLDIG_PLL4SR_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL4SR_LOLF_MASK32               ((uint32)0x00000008U)
#define PLLDIG_PLL4SR_LOCK_MASK32               ((uint32)0x00000004U)

/**************************************************************/
/*                 PLLDIG_PLL4DV                              */
/**************************************************************/
#define PLLDIG_PLL4DV_RWBITS_MASK32             ((uint32)0x7E3F70FFU)
#define PLLDIG_PLL4DV_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL4DV_RFDPHI1_MASK32            ((uint32)0x7E000000U)
#define PLLDIG_PLL4DV_RFDPHI1_SHIFT32           ((uint32)25U)

#define PLLDIG_PLL4DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
#define PLLDIG_PLL4DV_RFDPHI_SHIFT32            ((uint32)16U)

#define PLLDIG_PLL4DV_PREDIV_MASK32             ((uint32)0x00007000U)
#define PLLDIG_PLL4DV_PREDIV_SHIFT32            ((uint32)12U)

#define PLLDIG_PLL4DV_MFD_MASK32                ((uint32)0x000000FFU)

/**************************************************************/
/*                 PLLDIG_PLL4FD                              */
/**************************************************************/
#define PLLDIG_PLL4FD_RWBITS_MASK32             ((uint32)0x40007FFFU)
#define PLLDIG_PLL4FD_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL4FD_SMDEN_MASK32              ((uint32)0x40000000U)

#define PLLDIG_PLL4FD_MFN_MASK32                ((uint32)0x00007FFFU)
#define PLLDIG_PLL4FD_MFN_SHIFT32               ((uint32)0U)

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/


#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_PLLDIG_H */

/** @} */

